Repository: Alanoudfahad/Tajanb
Catalog: Localizable.xcstrings
Source language: en
Languages: ar

source: %@ allergen
ar: %@ مسببات الحساسية

source: %@ category
ar: %@فئة

source: Allergen-free message
ar: خالي من مكونات الحساسية

source: Avoid your allergic reactions
ar: تجنب ردود الفعل التحسسية لديك

source: Back
ar: رجوع

source: Camera permission is required to scan ingredients.
ar: مطلوب إذن الكاميرا لمسح المكونات.

source: Category: %@
ar: %@فئة

source: Check for any allergens in your photos by selecting an image from your Album to detect potentially harmful ingredients.
ar: يمكنك التحقق من المواد المسببة للحساسية عن طريق تحديد صورة من ألبوم الصور للبحث عن المكونات الضارة المحتملة.

source: Choose type of allergy you have?
ar: اختر نوع الحساسية الذي لديك؟

source: Close and Retake Photo
ar: أغلق والتقط صورة أخرى

source: Close Search
ar: اغلق البحث

source: Detected allergen from the selected image
ar: تم اكتشاف مسببات الحساسية من الصورة المحددة

source: Disclaimer
ar: تنويه:

source: Disclaimer: The app is not responsible for any missed ingredients during scanning.
ar: تنويه: التطبيق لا يتحمل المسؤولية في حال عدم تغطية جميع المكونات اثناء المسح

source: Displays what the camera is currently viewing
ar: يعرض ما تشاهده الكاميرا حاليًا

source: Do you have another type of allergy?
ar: هل تعاني من نوع آخر من الحساسية؟

source: Done
ar: تم

source: Double-tap to %@.
ar: انقر مرتين

source: Double-tap to go back to the previous screen.
ar: انقر نقرًا مزدوجًا للعودة إلى الشاشة السابقة.

source: Double-tap to go back.
ar: انقر مرتين للرجوع.

source: Double-tap to retake the photo
ar: انقر نقرًا مزدوجًا لإعادة التقاط الصورة

source: Double-tap to select an image for allergen detection
ar: انقر مرتين لتحديد صورة للكشف عن المواد المسببة للحساسية

source: Double-tap to suggest a new allergy type.
ar: انقر مرتين لاقتراح نوع جديد من الحساسية.

source: Double-tap to take a photo
ar: انقر نقرًا مزدوجًا لإعادة التقاط الصورة

source: Double-tap to toggle flash
ar: انقر نقرًا مزدوجًا لتشغيل الفلاش

source: Double-tap to upload a photo for scanning
ar: انقر مرتين لتحميل صورة للمسح الضوئي

source: Double-tap to view details.
ar: انقر نقرًا مزدوجًا لعرض التفاصيل.

source: Double-tap to view more details about %@
ar: انقر مرتين لعرض المزيد من التفاصيل حول %@

source: Double-tap to view your allergy categories
ar: انقر مرتين لعرض المزيد من التفاصيل

source: Enjoy Your food, Avoid Allergens
ar: تجنب مسببات الحساسية ، و تمتع بغذائك

source: Enter your suggestion here
ar: أدخل اقتراحك هنا

source: Error message
ar: خطا

source: Get Started
ar: ابدا

source: How it works
ar: كيف يعمل؟

source: Ingredient Scanner
ar: الماسح الضوئي للمكونات

source: Ingredients not found
ar: لم يتم العثور على المكونات

source: Key
ar: المفتاح

source: Language prompt message
ar: رسالة اللغة

source: Live camera preview
ar: معاينة الكاميرا المباشرة

source: My Allergies
ar: حساسياتي

source: My Allergies Title
ar: عنوان حساسيتي

source: OK
ar: تم

source: Open Search
ar: افتح البحث

source: Photo Picker
ar: أداة اختيار الصور

source: Point to an ingredient to scan
ar: أشر إلى أحد المكونات لفحصه

source: Scan a product’s ingredients to find out if it is suitable for you. Ensure all ingredients are captured for accurate results.
ar: قم بمسح قائمة مكونات المنتج و تحقق من مدى ملاءمته لك ، و تأكد من تغطية كافة المكونات لضمان دقة النتائج.

source: Search Allergies
ar: ابحث عن حساسية

source: Send
ar: ارسل

source: Skip
ar: تخطي

source: Suggest an allergy
ar: اقترح حساسية

source: Swipe through detected words
ar: اسحب لرؤية الكلمات المكتشفة

source: Take Photo
ar: التقط صورة

source: Take the picture now
ar: خذ الصورة الآن!

source: Thank You!
ar: شكرا

source: The selected image contains no allergens
ar: الصورة المحددة لا تحتوي على أي مسببات للحساسية

source: This app uses the camera to scan and recognize text from ingredients for allergen detection purposes
ar: يستخدم هذا التطبيق الكاميرا لمسح النص من المكونات والتعرف عليه لأغراض الكشف عن مسببات الحساسية

source: Turn flash off
ar: اطفاء الفلاش

source: Turn flash on
ar: تشغيل الفلاش

source: upload photo
ar: رفع صورة

source: Upload Photo
ar: رفع صورة

source: We need access to your photos to allow you to select images for text recognition.
ar: نحتاج إلى الوصول إلى صورك للسماح لك بتحديد الصور للتعرف على النص.

source: We received your suggestion, and its under review.
ar: تلقينا اقتراحك و سيتم مراجعته.

source: Welcome to Tajanb!
ar: مرحبا بك في تجنب

source: You can customize specific allergens through 'My Allergies'
ar: يمكنك تخصيص أنواع الحساسية الفرعية من خلال حساسياتي

source: Your Suggestion
ar: اقتراحك

# اختر صورة
source: Choose a photo
ar: اختر صورة

# اختيار الكل
source: Select All
ar: اختيار الكل

# اضغط مرتين للرجوع.
source: click twice to go back
ar: اضغط مرتين للرجوع

# الرجوع
source: Back
ar: الرجوع

# تحميل صورة
source: Upload photo
ar: تحميل صورة

# تم
source: Done
ar: تم

# حساسية الطعام
source: Food allergy
ar: حساسية الطعام

# حساسيني
source: My Allergies
ar: حساسيني

# خالي من مسببات الحساسية
source: Free from food allergy
ar: خالي من مسببات الحساسية

# خذ الصورة الآن
source: Take a picture now!
ar: خذ الصورة الآن!

# لم يتم اختيار صورة
source: No image selected
ar: لم يتم اختيار أي صورة

# نتيجة المكونات الموضحة في الصورة
source: The result of the ingredients shown in the picture
ar: نتيجة المكونات الموضحة في الصورة

# وجه الكاميرا نحو المكونات للمسح
source: Point to an ingredient to scan
ar: وجه الكاميرا نحو المكونات للمسح
